### ODC元素分类与边界
# 目标物类型 1
odc_target = [
    {'ODC元素': '目标物类型', 'ODC边界': ['机动车','行人','静态障碍物'], 'type': 4},
    {'权重':{'第二层权重':[1]}}
    ]

# 地图与定位 2
odc_map = [
    {'ODC元素': '地图', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '定位系统', 'ODC边界': ['北斗'], 'type': 4},
    {'权重':{'第二层权重':[0.5,0.5]}}
    ]

# 驾乘人员状态 3
odc_diver = [  
    {'ODC元素': '注意力状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '位姿状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '安全带状态', 'ODC边界': [0, 1], 'type': 1},
    {'权重':{'第二层权重':[1],'第三层权重':[0.2,0.3,0.5]}}
    ]

# 交通条件 4
odc_traffic_condition = [
    {'ODC元素': '交通事件', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '交通拥堵度', 'ODC边界': ['畅通','缓行'], 'type': 1},
    {'ODC元素': '可协作车辆', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '交通法规', 'ODC边界': [0, 1], 'type': 1},
    {'权重':{'第二层权重':[0.3,0.1,0.3,0.3]}}
    ]

# 环境因素 5
odc_environment = [
    {'ODC元素': '风', 'ODC边界': [0, 10.7], 'type': 3.2},
    {'ODC元素': '雪', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '雨', 'ODC边界': [0, 0.25], 'type': 3.2},
    {'ODC元素': '气温', 'ODC边界': [-20, 45], 'type': 2.2},
    {'ODC元素': '雾霾', 'ODC边界': [0, 500], 'type': 3.2}, # 待定 json中为39
    {'ODC元素': '光照条件', 'ODC边界': ["白天"], 'type': 4},
    {'权重':{'第二层权重':[0.3,0.1,0.3,0.3],'第三层权重':[[0.15,0.5,0.35],[1],[1],[1]]}}
    ]

# 道路设施 6
odc_road_facility = [
    {'ODC元素': '交通标志', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '交通信号灯', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '智能路侧设施', 'ODC边界': [0, 200], 'type': 3.2},
    {'ODC元素': '特殊设施', 'ODC边界': ['桥梁','隧道','减速带','限高'], 'type': 4},
    {'权重':{'第二层权重':[0.3,0.4,0.3],'第三层权重':[[0.5,0.5],[1],[1]]}}
    ]

# 数字信息 7
odc_digital_info = [
    {'ODC元素': '消息体', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '信源发送频率', 'ODC边界': [0, 1], 'type': 1},
    {'权重':{'第二层权重':[0.5,0.5]}}
    ]

# 道路属性 8
odc_road_attribute = [
    {'ODC元素': '区域', 'ODC边界': ['地理围栏'], 'type': 4},
    {'ODC元素': '城市道路', 'ODC边界': ['快速路','主干路','次干路'], 'type': 4},
    {'ODC元素': '高速公路', 'ODC边界': ['高速公路','一级公路'], 'type': 4},
    {'ODC元素': '乡村道路', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '道路表面状况', 'ODC边界': ['正常'], 'type': 4},
    {'ODC元素': '纵断面坡度', 'ODC边界': [0, 0.04], 'type': 3.2},
    {'ODC元素': '道路曲率半径', 'ODC边界': [0, 500], 'type': 3.2},
    {'ODC元素': '道路交叉', 'ODC边界': ['人行横道','匝道','有信号灯路口','无信号灯路口','一般立交','枢纽立交'], 'type': 4},
    {'ODC元素': '标线质量', 'ODC边界': [6, 8], 'type': 3.1},
    {'ODC元素': '车道状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '车道宽度', 'ODC边界': [3, 3.75], 'type': 3.1},
    {'ODC元素': '车道标线颜色', 'ODC边界': ['yellow','white'], 'type': 4},
    {'ODC元素': '车道类型', 'ODC边界': ['driving','shoulder'], 'type': 4},
    {'ODC元素': '车道数量', 'ODC边界': [1, 8], 'type': 5}, #车道数是否包含在[1,8之间]
    {'权重':{'第二层权重':[0.3,0.1,0.3,0.3],'第三层权重':[[0.55,0.15,0.15,0.15],[1],[0.1,0.4,0.5],[0.3,0.4,0.1,0.05,0.1,0.05]]}}
    ]

# 通讯与计算 9
odc_communication = [
    {'ODC元素': '丢包率', 'ODC边界': [0, 0.05], 'type': 3.2},  # 0～5%
    {'ODC元素': '通信时延', 'ODC边界': [0, 50], 'type': 3.2},  # 时延（ms）
    {'ODC元素': '通信模式', 'ODC边界': ['V2I','V2V','V2N'], 'type': 4},
    {'权重':{'第二层权重':[0.25,0.25,0.5]}}
    ]

# 车辆状态 10
odc_vehicle_status = [
    {'ODC元素': '协同驾驶功能状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': 'LKA功能', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': 'ACC功能', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': 'AEB功能', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '车速', 'ODC边界': [0, 100], 'type': 3.2}, # 1
    {'ODC元素': '前向距离', 'ODC边界': [50, 200], 'type': 3.1}, # 2
    {'ODC元素': '横向加速度', 'ODC边界': [0, 5], 'type': 3.2}, # 3
    {'ODC元素': '横摆角速度', 'ODC边界': [0, 10], 'type': 3.2}, # 4
    {'ODC元素': '方向盘转角', 'ODC边界': [0, 10], 'type': 3.2}, # 5
    {'ODC元素': '前向碰撞预警', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '异常车辆预警', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '紧急车辆预警', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': 'GNSS 信号故障', 'ODC边界': [0, 1], 'type': 1}, #
    {'ODC元素': '域控状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '总线状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '以太网状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '传感器状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '计算平台状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '硬件状态', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '系统状态', 'ODC边界': [0, 1], 'type': 1}, #
    {'ODC元素': '档位', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '刹车', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '电子手刹', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '油门开度', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '车辆模式', 'ODC边界': ['ACC','LKA','LDW','LCA','BSA'], 'type': 4},
    {'ODC元素': '前雨刮器', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '转向灯关闭', 'ODC边界': [0, 1], 'type': 1},
    {'ODC元素': '车门状态', 'ODC边界': [0, 1], 'type': 1},
    {'权重':{'第二层权重':[0.25,0.1,0.3,0.25,0.1],
           '第三层权重':[[0.5,0.15,0.1,0.25],
                        [0.35,0.2,0.2,0.2,0.05],
                        [0.3,0.3,0.4],
                        [0.1,0.15,0.15,0.1,0.1,0.1,0.1,0.2],
                        [0.05,0.15,0.15,0.15,0.05,0.05,0.1,0.3]]}}
    ]

KEY_INDEX_MAP = {
    '目标物': 0,
    '地图与定位': 1,
    '驾乘人员状态': 2,
    '交通条件': 3,
    '环境条件': 4,
    '道路设施': 5,
    '数字信息': 6,
    '道路属性': 7,
    '通讯与计算': 8,
    '车辆状态': 9,
}

w_map = {
    '目标物': 0.1,
    '地图与定位': 0.1,
    '驾乘人员状态': 0.1,
    '交通条件': 0.1,
    '环境条件': 0.1,
    '道路设施': 0.1,
    '数字信息': 0.1,
    '道路属性': 0.1,
    '通讯与计算': 0.1,
    '车辆状态': 0.1,
}

all_odc_boundary = [odc_target, odc_map, odc_diver, odc_traffic_condition,
                    odc_environment, odc_road_facility, odc_digital_info,
                    odc_road_attribute, odc_communication, odc_vehicle_status] # 十类ODC元素